yicheng55/dm9051_mcu_project/sdk32f415v2.0.9_dm9051_test_offload_udp_tx/developer/dm9051_lw2312v1_5.2P/at32f4xx_conf_2xspi.h
/**
 **************************************************************************
 * @file     dm9051_lw_conf.h
 * @version  v1.0
 * @date     2023-04-28
 * @brief    header file of dm9051 environment config program.
 **************************************************************************
 *                       Copyright notice & Disclaimer
 *
 * The software Board Support Package (BSP) that is made available to
 * download from Artery official website is the copyrighted work of Artery.
 * Artery authorizes customers to use, copy, and distribute the BSP
 * software and its related documentation for the purpose of design and
 * development in conjunction with Artery microcontrollers. Use of the
 * software is governed by this copyright notice and the following disclaimer.
 *
 * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
 * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
 * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
 * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
 * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
 *
 **************************************************************************
 */
#ifndef __AT32F4XX_CONF_2XSPI_H
#define __AT32F4XX_CONF_2XSPI_H

#include "at32f415.h"
#include "at32f415_spi.h"
#include "at32f415_gpio.h"
#include "dm9051opts.h" //driver attributes

//
// at437_conf_x2spi.h //2.yc
//
typedef struct spihead_sel_st
{
	char *spi_name;
	spi_type *spi_num;								 //= SPIPORT;
	crm_periph_clock_type spi_crm_clk; //= SPI_CRM_CLK;
} spihead_t;

typedef struct gpio_sel_st
{
	gpio_type *gpport;									//= PORT;
	uint16_t pin;												//= PIN;
	crm_periph_clock_type gpio_crm_clk; //= CRM_CLK;
	gpio_mode_type gpio_mode;						//= type
	gpio_pins_source_type pinsrc;
	gpio_mux_sel_type muxsel;
} gpio_t;

typedef struct gp_set_st
{
	const char *gp_info;
	const gpio_t gp;
} gp_set_t;

typedef struct extline_st
{
	crm_periph_clock_type intr_crm_clk; // CRM_GPIOC_PERIPH_CLOCK,
	uint32_t extline;										//= LINE
	IRQn_Type irqn;											//= EXINTn_m
} extline_t;

typedef struct extint_init_st
{
	crm_periph_clock_type scfg_clk;
#if !defined(AT32F437xx)
	gpio_port_source_type scfg_port_src;
	gpio_pins_source_type scfg_pin_src;
#elif defined(AT32F437xx)
	scfg_port_source_type scfg_port_src; // SCFG_PORT_SOURCE_X
	scfg_pins_source_type scfg_pin_src;	 // SCFG_PINS_SOURCEX
#endif
} extint_init_t;

typedef struct
{
	char *cpu_api_info; // cpu name is for the purpose to lead the pins, for easy recogition!
	spihead_t spidef;
	gpio_t wire_sck;
	gpio_t wire_mi;
	gpio_t wire_mo;
	gpio_t wire_cs;
} spi_dev_t;

struct extscfg_st
{ // struct linescfg_st
	const char *irq_enable_inf;
	extline_t extline;
};

struct modscfg_st
{
	const char *scfg_inf;
	extint_init_t scfg_init;
	struct extscfg_st *extend; // struct linescfg_st *extend; //essential
	gp_set_t *option;
};

#if (BOARD_SPI_COUNT >= 2)
#define board_conf_type "\"dm9051_at32_mf\""
// 1.const void *intr_pack = pdn; (without gpio)
// 2.const void *intr_pack = pde; (with gpio)
// 3.const void *intr_pack = NULL;
const void *intr_pack = NULL;
// 1.const gp_set_t *common_rst = NULL;
const gp_set_t *common_rst = NULL; //&pb8_rst_gpio_set;

#define devconf devconf_XXX
const static spi_dev_t devconf_XXX[BOARD_SPI_COUNT] = {
#ifndef AT32F437xx
		/**/
		{
				// ethernet f413
				// ethernet f413 spi2(crm, gpio)
				"AT32F413 SPI2 ETHERNET, sck/mi/mo/cs pb13/pb14/pb15/pb12",
				{"SPI2", SPI2, CRM_SPI2_PERIPH_CLOCK},
				{GPIOB, GPIO_PINS_13, CRM_GPIOB_PERIPH_CLOCK, GPIO_MODE_MUX, GPIO_PINSRC_NULL, GPIO_MUX_NULL}, // ISCK
				{GPIOB, GPIO_PINS_14, CRM_GPIOB_PERIPH_CLOCK, GPIO_MODE_MUX, GPIO_PINSRC_NULL, GPIO_MUX_NULL}, // IMISO
				{GPIOB, GPIO_PINS_15, CRM_GPIOB_PERIPH_CLOCK, GPIO_MODE_MUX, GPIO_PINSRC_NULL, GPIO_MUX_NULL}, // IMOSI

				{GPIOB, GPIO_PINS_12, CRM_GPIOB_PERIPH_CLOCK, GPIO_MODE_OUTPUT, GPIO_PINSRC_NULL, GPIO_MUX_NULL}, //(PB12) Test-ISP2 OK
																																																					//{GPIOA, GPIO_PINS_4, CRM_GPIOA_PERIPH_CLOCK, GPIO_MODE_OUTPUT, GPIO_PINSRC_NULL, GPIO_MUX_NULL}, //(PB12) Test-ISP2 OK
		},
		{
				// ethernet f413
				// ethernet f413 spi2(crm, gpio)

				//"AT32F413 SPI1 ETHERNET, sck/mi/mo/cs pb2/pb0/pc4/pa6",
				"AT32F413 SPI1 ETHERNET, sck/mi/mo/cs pa5/pa6/pa7/pa4",

				{"SPI1", SPI1, CRM_SPI1_PERIPH_CLOCK},

				//{GPIOB, GPIO_PINS_2, CRM_GPIOB_PERIPH_CLOCK, GPIO_MODE_MUX, GPIO_PINSRC_NULL, GPIO_MUX_NULL},  //ISCK
				//{GPIOB, GPIO_PINS_0, CRM_GPIOB_PERIPH_CLOCK, GPIO_MODE_MUX,	GPIO_PINSRC_NULL, GPIO_MUX_NULL},	//IMISO
				//{GPIOC, GPIO_PINS_4, CRM_GPIOC_PERIPH_CLOCK, GPIO_MODE_MUX,	GPIO_PINSRC_NULL, GPIO_MUX_NULL},	//IMOSI

				//{GPIOA, GPIO_PINS_6, CRM_GPIOA_PERIPH_CLOCK, GPIO_MODE_OUTPUT, GPIO_PINSRC_NULL, GPIO_MUX_NULL}, //(PB12) Test-ISP2 OK

				{GPIOA, GPIO_PINS_5, CRM_GPIOA_PERIPH_CLOCK, GPIO_MODE_MUX, GPIO_PINSRC_NULL, GPIO_MUX_NULL},		// ISCK
																																																				//{GPIOA, GPIO_PINS_6, CRM_GPIOA_PERIPH_CLOCK, GPIO_MODE_MUX,	GPIO_PINSRC_NULL, GPIO_MUX_NULL},	//IMISO
				{GPIOA, GPIO_PINS_6, CRM_GPIOA_PERIPH_CLOCK, GPIO_MODE_INPUT, GPIO_PINSRC_NULL, GPIO_MUX_NULL}, // IMISO
				{GPIOA, GPIO_PINS_7, CRM_GPIOA_PERIPH_CLOCK, GPIO_MODE_MUX, GPIO_PINSRC_NULL, GPIO_MUX_NULL},		// IMOSI

				{GPIOB, GPIO_PINS_12, CRM_GPIOB_PERIPH_CLOCK, GPIO_MODE_OUTPUT, GPIO_PINSRC_NULL, GPIO_MUX_NULL}, //(PB12) Test-ISP2 OK
				//{GPIOA, GPIO_PINS_4, CRM_GPIOA_PERIPH_CLOCK, GPIO_MODE_OUTPUT, GPIO_PINSRC_NULL, GPIO_MUX_NULL}, //(PB12) Test-ISP2 OK
		},
#else
		// #endif
		// #ifdef AT32F437xx
		/**/
		{
				// ethernet f437 spi4(crm, gpio)
				"AT32F437 SPI4 ETHERNET, sck/mi/mo/cs pe2/pe5/pe6/pe4",
				{"SPI4", SPI4, CRM_SPI4_PERIPH_CLOCK},
				{GPIOE, GPIO_PINS_2, CRM_GPIOE_PERIPH_CLOCK, GPIO_MODE_MUX, GPIO_PINS_SOURCE2, GPIO_MUX_5},			 // ISCK
				{GPIOE, GPIO_PINS_5, CRM_GPIOE_PERIPH_CLOCK, GPIO_MODE_MUX, GPIO_PINS_SOURCE5, GPIO_MUX_5},			 // IMISO
				{GPIOE, GPIO_PINS_6, CRM_GPIOE_PERIPH_CLOCK, GPIO_MODE_MUX, GPIO_PINS_SOURCE6, GPIO_MUX_5},			 // IMOSI
				{GPIOE, GPIO_PINS_4, CRM_GPIOE_PERIPH_CLOCK, GPIO_MODE_OUTPUT, GPIO_PINSRC_NULL, GPIO_MUX_NULL}, //(PE4) Test-ISP4 OK
		},
		{
				// ethernet f437 spi2(crm, gpio)
				"AT32F437 SPI2 ETHERNET, sck/mi/mo/cs pd1/pc2/pd4/pd0",
				{"SPI2", SPI2, CRM_SPI2_PERIPH_CLOCK},
				{GPIOD, GPIO_PINS_1, CRM_GPIOD_PERIPH_CLOCK, GPIO_MODE_MUX, GPIO_PINS_SOURCE1, GPIO_MUX_6},			 // ISCK
				{GPIOC, GPIO_PINS_2, CRM_GPIOC_PERIPH_CLOCK, GPIO_MODE_MUX, GPIO_PINS_SOURCE2, GPIO_MUX_5},			 // IMISO
				{GPIOD, GPIO_PINS_4, CRM_GPIOD_PERIPH_CLOCK, GPIO_MODE_MUX, GPIO_PINS_SOURCE4, GPIO_MUX_6},			 // IMOSI
				{GPIOD, GPIO_PINS_0, CRM_GPIOD_PERIPH_CLOCK, GPIO_MODE_OUTPUT, GPIO_PINSRC_NULL, GPIO_MUX_NULL}, //(PD0) Test-ISP2 OK
		},
		{
				// ethernet f437 spi1(crm, gpio)
				"AT32F437 SPI1 ETHERNET, sck/mi/mo/cs pa5/pa6/pa7/pa15",
				{"SPI1", SPI1, CRM_SPI1_PERIPH_CLOCK},
				{GPIOA, GPIO_PINS_5, CRM_GPIOA_PERIPH_CLOCK, GPIO_MODE_MUX, GPIO_PINS_SOURCE5, GPIO_MUX_5},				// ISCK
				{GPIOA, GPIO_PINS_6, CRM_GPIOA_PERIPH_CLOCK, GPIO_MODE_MUX, GPIO_PINS_SOURCE6, GPIO_MUX_5},				// IMISO
				{GPIOA, GPIO_PINS_7, CRM_GPIOA_PERIPH_CLOCK, GPIO_MODE_MUX, GPIO_PINS_SOURCE7, GPIO_MUX_5},				// IMOSI
				{GPIOA, GPIO_PINS_15, CRM_GPIOA_PERIPH_CLOCK, GPIO_MODE_OUTPUT, GPIO_PINSRC_NULL, GPIO_MUX_NULL}, //(PA15) Test-ISP1 OK
		},
#endif
};

#define CS_LONG 0
#define CS_EACH 1
typedef struct
{
	uint8_t cs_mode;
	char *desc;
} csmode_t;

// uint8_t cs_mode = 0;
// csmode_t csmodes[3] = {
// 		{CS_EACH, "CS_EACH_MODE"},
// 		{CS_LONG, "CS_LONG_MODE"},
// 		{CS_EACH, "CS_EACH_MODE"},
// };

typedef struct
{
	uint8_t iomode;
	csmode_t longcsmode; // long chip_select mode
	char *desccssmode;
	uint8_t phy27;
	uint8_t ncrmode;
} DM9051_Options;

DM9051_Options dm9051optsex[BOARD_SPI_COUNT] = {
		{
				MBNDRY_WORD,
				CS_LONG,
				"CS_LONG_MODE",
				0,
				0,
		},
		{
				MBNDRY_BYTE,
				CS_EACH,
				"CS_EACH_MODE",
				0,
				0,
		},
//		{
//				MBNDRY_WORD,
//				CS_EACH,
//				"CS_EASH_MODE",
//				0,
//				0,
//		},
};

#define dm9051optsex_iomode() dm9051optsex[pin_code].iomode
#define dm9051optsex_longcsmode() dm9051optsex[pin_code].longcsmode
#define dm9051optsex_desccsmode() dm9051optsex[pin_code].desccssmode

//[common.macro]
//
// 'pin_code' always 0. when ETHERNET_COUNT==1, but BOARD_SPI_COUNT > 1.
//
int pin_code = 0;
// #define spi_dev()					&devconf
#define gpio_wire_sck() devconf[pin_code].wire_sck
#define gpio_wire_mi() devconf[pin_code].wire_mi
#define gpio_wire_mo() devconf[pin_code].wire_mo
#define gpio_cs() devconf[pin_code].wire_cs
#define spihead() devconf[pin_code].spidef
#define intr_data() ((struct modscfg_st *)intr_pack)								//((intr_param_t *)intr_pack)
#define intr_data_scfg() (((struct modscfg_st *)intr_pack)->extend) //(((intr_param_t *)intr_pack)->scfg)

#define intr_gpio_data() ((gp_set_t *)intr_data()->option)
#define intr_gpio_exister() (intr_pack) ? intr_data()->option ? 1 : 0 : 0 //(!intr_pack) ? 0 : (intr_data()->scfg.next_avail == NEXT_AVAILABLE) ? 1 : 0

#define exint_scfg_exister() (intr_pack)
#define exint_scfg_ptr() (!intr_pack) ? NULL : intr_data()->extend //(!intr_pack) ? NULL : &(intr_data()->scfg)
#define scfg_info() (intr_data()->scfg_inf)
#define scfg_crm() (intr_data()->scfg_init.scfg_clk)
#define scfg_port() (intr_data()->scfg_init.scfg_port_src)
#define scfg_pin() (intr_data()->scfg_init.scfg_pin_src)
#define rst_gpio_data() (common_rst)

#define cpuhead() devconf[pin_code]
#define cpu_spi_conf_name() cpuhead().cpu_api_info
#define spi_number() spihead().spi_num //= spi_no()
#define spi_crm() spihead().spi_crm_clk
#define spi_conf_name() spihead().spi_name

#define exint_enable_info() (intr_data_scfg()->irq_enable_inf)
#define exint_extline() (intr_data_scfg()->extline.extline)
#define exint_crm() (intr_data_scfg()->extline.intr_crm_clk)
#define intr_gpio_info() (intr_gpio_data()->gp_info)
#define intr_gpio_ptr() ((const gpio_t *)(&intr_gpio_data()->gp))

#define rst_gpio_info() (rst_gpio_data()->gp_info)
#define rst_gpio_ptr() ((const gpio_t *)(&rst_gpio_data()->gp))
#define rst_gpio_exister() (rst_gpio_data() ? 1 : 0)
// #define rst_gpio_info()			(intr_gpio_data()->gp_info)
// #define rst_gpio_ptr()			&(intr_gpio_data()->gp)

#define mstep_set_index(i) pin_code = i // empty for 1 eth project
#define mstep_turn_net_index()					// empty for 1 eth project

//-
#define mstep_get_index() pin_code
// #define _mstep_get_net_index()	pin_code
#endif

// // SPI_TypeDef* SPIx;  SPI_TypeDef structure defined in at32f4xx_spi.h
// // spi_init_type spi_init_struct;  spi_init_type structure defined in at32f4xx_spi.h
// // typtedef struct  SPI_TypeDef

// typedef struct
// {
//   SPI_TypeDef* SPIx;
//   spi_init_type spi_init_struct;
//   IRQn_Type IRQn;
//   uint32_t interrupt;
// } SPI_Config;

// SPI_Config spi_configs[BOARD_SPI_COUNT] = {
//   {
//     SPI1,
//     {
//       SPI_TRANSMIT_HALF_DUPLEX_TX,
//       SPI_MODE_MASTER,
//       SPI_MCLK_DIV_8,
//       SPI_FIRST_BIT_MSB,
//       SPI_FRAME_8BIT,
//       SPI_CLOCK_POLARITY_LOW,
//       SPI_CLOCK_PHASE_2EDGE,
//       SPI_CS_SOFTWARE_MODE
//     },
//     SPI1_IRQn,
//     SPI_I2S_TDBE_INT
//   },
//   {
//     SPI2,
//     {
//       SPI_TRANSMIT_HALF_DUPLEX_RX,
//       SPI_MODE_SLAVE,
//       SPI_MCLK_DIV_8,
//       SPI_FIRST_BIT_MSB,
//       SPI_FRAME_8BIT,
//       SPI_CLOCK_POLARITY_LOW,
//       SPI_CLOCK_PHASE_2EDGE,
//       SPI_CS_SOFTWARE_MODE
//     },
//     SPI2_IRQn,
//     SPI_I2S_RDBF_INT
//   },
//   // Add more SPI configurations here as needed
// };

// // static void spi_config(void)
// // {
// //   crm_periph_clock_enable(CRM_SPI1_PERIPH_CLOCK, TRUE);
// //   crm_periph_clock_enable(CRM_SPI2_PERIPH_CLOCK, TRUE);

// //   for (int i = 0; i < BOARD_SPI_COUNT; ++i)
// //   {
// //     spi_default_para_init(&spi_configs[i].spi_init_struct);
// //     spi_init(spi_configs[i].SPIx, &spi_configs[i].spi_init_struct);

// //     nvic_irq_enable(spi_configs[i].IRQn, 0, 0);
// //     spi_i2s_interrupt_enable(spi_configs[i].SPIx, spi_configs[i].interrupt, TRUE);

// //     spi_enable(spi_configs[i].SPIx, TRUE);
// //   }
// // }

#endif //__AT32F4XX_CONF_2XSPI_H
